--집계함수
--제품테이블에서 제조업체의 수를 검색
select 제조업체 from 제품;
select count(제조업체) from 제품;
--중복 제외
select count(DISTINCT 제조업체) as "제조업체의 수" from 제품;

--주문테이블에서 주문고객의 수
select count(*) from 주문;
select count(distinct 주문고객) as "주문고객의 수" from 주문;

--그룹별 검색
--주문테이블에서 주문제품별 수량의 합계를 검색
select 주문제품, sum(수량) from 주문 group by 주문제품 order by 주문제품;

--주문테이블에서 주문고객별 수량의 평균을 검색(수량의 평균은 소수점 이하 첫째자리까지 출력)
select 주문고객, round(avg(수량), 1) as "수량의 평균" from 주문 group by 주문고객 order by 주문고객;

--고객테이블에서 등급별 적립금의 평균을 등급 기준으로 오름차순 검색(적립금의 평균은 소수점 이하 둘째자리까지 출력)
select 등급, round(avg(적립금), 2) as "적립금의 평균" from 고객 group by 등급 order by 등급;

--제품테이블에서 제조업체별로 제조한 제품의 개수와 제품 중 가장 비싼 단가를 검색(제품의 개수는 제품수, 가장 비싼 단가는 최고가로 출력)
select 제조업체, count(*) as 제품수, max(단가) as 최고가 from 제품 group by 제조업체;

--제품테이블에서 [제품을 3개 이상 제조한] 제조업체별로 제조한 제품의 개수와 제품 중 가장 비싼 단가를 검색(제품의 개수는 제품수, 가장 비싼 단가는 최고가로 출력)
select 제조업체, count(*) as 제품수, max(단가) as 최고가 from 제품 group by 제조업체 having count(*)>=3;

--고객테이블에서 직업별 나이의 평균과 가장 작은 적립금을 검색(나이의 평균은 평균나이, 가장 작은 적립금은 최저 적립금으로 출력)
select 직업, avg(나이) as 평균나이, min(적립금) as "최저 적립금" from 고객 group by 직업;

--제품테이블에서 [제품을 2개 이하 제조한] 제조업체별로 제조한 제품의 개수와 제품 중 가장 비싼 단가 중 [4000원 이상인 것]를 검색(제품의 개수는 제품수, 가장 비싼 단가는 최고가로 출력)
select 제조업체, count(*) as 제품수, max(단가) as 최고가 from 제품 group by 제조업체 having count (*)<=2 and max(단가) >=4000;
--(*)를 쓰는 이유 -> 그룹에 속한 모든 행을 카운트한다. null이 있던 없던 전부를 카운트. 컬럼명을 쓰면 null은 카운트 안 함

--고객테이블에서 적립금 평균이 1000원 이상인 등급에 대해 등급별 고객수와 적립금 평균을 검색(고객수는 고객수, 적립금 평균은 평균 적립금(소수점 이하 둘째자리까지)으로 출력)
select 등급, count(*) as 고객수, round(avg(적립금), 2) as "평균 적립금" from 고객 group by 등급 having avg(적립금)>=1000;

--주문테이블에서 각 주문고객이 주문한 제품의 총주문수량을 주문제품별로 검색(주문제품(p01~p03), 주문고객, 총주문수량(30개 이상)을 컬럼으로 출력)
select 주문제품, 주문고객, sum(수량) as 총주문수량 from 주문 group by 주문제품, 주문고객 having sum(수량)>=30 and 주문제품 in('p01', 'p02', 'p03') order by 주문제품 ;


--join
--자연조인(natural join)
--주문테이블과 제품테이블에서 주문번호, 주문고객, 제품명, 단가, 제조업체를 검색
select 주문번호, 주문고객, 제품명, 단가, 제조업체 from 주문, 제품 where 주문제품=제품번호;

--banana고객이 주문한 제품의 이름을 검색
select 제품명 from 주문,제품 where 주문고객='banana' and 주문제품=제품번호;

--고객이름, 나이, 직업, 제품명, 단가, 주문일자, 배송지 등을 apple고객이 주문한 정보로 검색
select * from 주문;
select 고객이름, 나이, 직업, 제품명, 단가, 주문일자, 배송지 from 고객, 제품, 주문 where 주문고객='apple' and (고객아이디=주문고객) and (주문제품=제품번호);

--나이가 30세 이상인 고객이 주문한 제품의 번호, 제품명, 주문일자를 검색
select 주문제품, 제품명, 나이, 주문일자 from 고객, 제품, 주문 where 나이>=30 and (고객아이디=주문고객) and (주문제품=제품번호);